Simulations/MEXICO/Publication/Run2/system/fvSchemes_RANS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default            steadyState;
}

gradSchemes
{
    default            Gauss linear;
    grad(p)             Gauss linear;
    grad(U)             Gauss linear;
}

divSchemes
{
    default             none;
    div(phi,U)          Gauss upwind grad(U);
    div((nuEff*dev(T(grad(U)))))    Gauss linear;
    div(phi,epsilon)    Gauss upwind;
    div(phi,k)          Gauss upwind;
}

laplacianSchemes
{
    default             Gauss linear limited 0.333;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             limited 0.333;
}

fluxRequired
{
    default             no;
    p;
}


// ************************************************************************* //
